In [1]:
# Load some sample datasets
import pickle
with open('dataframes.pkl', 'rb') as f:
    dataframes=pickle.load(f)

In [2]:
persons=dataframes['persons']
purchases=dataframes['purchases']
companies=dataframes['companies']

In [4]:
display(persons.head())
display(purchases.head())
display(companies.head())

,first_name,last_name,ssn,address,credit_card_number
0,Barbara,Johnson,604-68-1002,"12580 James Park\nSchroederstad, ID 87258",213134843482902
1,Pamela,Anderson,894-27-8020,"073 Adam River\nEast Charlesside, NY 73957",3551490253547855
2,Lori,Walker,584-90-8083,Unit 3005 Box 1168\nDPO AP 57757,180015515584431
3,Jamie,Parks,164-81-5139,"1710 Michael Radial\nNorth John, IN 47196",375961174587782
4,Jacqueline,Frederick,076-40-4313,"084 Sarah Port\nShawnshire, AK 58452",4669793179148055

,purchase_id,price,isbn10,credit_card_number,credit_card_provider
0,7664067494,773,0-8006-9624-7,676341754494,JCB 15 digit
1,5284840486,939,0-398-36655-1,5363444727745754,American Express
2,6281509968,299,1-966966-66-0,373100687111234,VISA 19 digit
3,6935927467,730,1-4289-2576-7,4165848356210422,Diners Club / Carte Blanche
4,7189067483,361,0-427-63069-X,180002501053191,VISA 16 digit

,ssn,address,company,phone_number
0,304-91-4153,"987 Warner Islands\nKinghaven, VT 77660",Scott Group,303-792-9535x3105
1,604-61-3982,"969 Ernest Islands\nJohnsonside, VT 58245",Martinez and Sons,8899059536
2,835-42-2759,"825 Oconnor Forges\nLake Jameschester, ND 48864","Coleman, Jackson and Harris",911.792.8988
3,607-95-8482,"3467 Schultz Mountains\nNorth Robert, ND 65603",Buckley PLC,001-463-066-5254
4,032-01-9274,"140 Kristin Avenue\nCookmouth, WY 84821","Ball, Boone and Robinson",354.492.7988

In [3]:
import pandas as pd

# Question 1
# Get a list of all companies that Barbara Johnson has worked at

In [5]:
import pandas as pd
df=pd.merge(persons,companies,on="ssn")
reduced_df=df[(df["first_name"]=="Barbara") & (df["last_name"]=="Johnson")]
reduced_df["company"]

0             Anderson-Holmes
1             Carroll-Jackson
2    Sloan, Moreno and Chaney
Name: company, dtype: object

In [6]:
# Question 2
# Who hasn't made a purchase yet?
# Another answer, using left join
df=pd.merge(persons,purchases,how="left",on="credit_card_number")
df[df["purchase_id"].isnull()].head()


# inner join
df=pd.merge(persons,purchases,how="inner",on="credit_card_number")
people_who_did=df["ssn"]
persons[~persons["ssn"].isin(people_who_did)].head()

,first_name,last_name,ssn,address,credit_card_number,purchase_id,price,isbn10,credit_card_provider
2,Pamela,Anderson,894-27-8020,"073 Adam River\nEast Charlesside, NY 73957",3551490253547855,NaN,NaN,NaN,NaN
9,Karen,Mcguire,768-37-9066,"7243 Glenn Brooks\nBrownside, OR 45417",3523509632164440,NaN,NaN,NaN,NaN
21,Laurie,Herman,044-96-2847,"PSC 3637, Box 0679\nAPO AA 25981",30362487677872,NaN,NaN,NaN,NaN
22,Joshua,Thompson,555-30-7328,"004 Megan Views\nRamosburgh, ID 74422",502076034615,NaN,NaN,NaN,NaN
27,Karen,White,538-23-6556,"5522 Rivas Pass Suite 846\nSouth Tabithastad, ...",5295580064344405,NaN,NaN,NaN,NaN

In [5]:
import numpy as np

# Question 3
# For everyone who bought something, what's the average price they paid?

In [6]:
# Question 4
# Create a DataFrame of company name to ISBN indicating which companies may have reiumbersed people for 
# certain purchases